#+title: Contents

** DONE food_acquired.py
CLOSED: [2023-03-07 Tue 21:10]
Test...
#+begin_src python :results output
import pandas as pd

fa = pd.read_parquet('../var/food_acquired.parquet')

print(fa.describe())
#+end_src

#+results:
#+begin_example
            quantity  value_purchased  ...            Kgs  Kgs Purchased
count  189663.000000    189663.000000  ...  189663.000000  189663.000000
mean      120.060827        38.112630  ...       0.475441       0.477268
std       638.640276       218.505495  ...       0.639778       0.665748
min         0.000000         0.000000  ...       0.000000       0.000000
25%         1.000000        10.000000  ...       0.000000       0.000000
50%         2.000000        20.000000  ...       0.160000       0.160000
75%        10.000000        40.000000  ...       1.000000       1.000000
max     58800.000000     70000.000000  ...      52.500000      52.500000

[8 rows x 6 columns]
#+end_example
** DONE food_prices_quantities_and_expenditures.py
CLOSED: [2023-03-07 Tue 21:12]
Test...
#+begin_src python :results output
import pandas as pd

print(pd.read_parquet('../var/food_prices.parquet').describe())
print(pd.read_parquet('../var/food_quantities.parquet').describe())
print(pd.read_parquet('../var/food_expenditures.parquet').describe())
#+end_src

#+results:
#+begin_example
       unitvalue_purchase
count        3.153600e+05
mean         2.776713e+03
std          3.341748e+04
min          1.000000e-01
25%          8.333333e+02
50%          1.400000e+03
75%          2.400000e+03
max          8.000000e+06
       quant_ttl_consume
count      434116.000000
mean            3.082105
std            47.187853
min             0.001000
25%             0.500000
50%             1.000000
75%             3.000000
max         10500.000000
       value_purchase
count   338007.000000
mean      2394.617389
std       3434.192279
min          0.340000
25%        500.000000
50%       1400.000000
75%       3000.000000
max     450000.000000
#+end_example

